/**************************************************************************************
注意事项：一定要将JOE短接片短接到GND端，如果不需要595后面的小灯点亮可以拔掉JP595短接片。
OE短接GND是因为低电平输出有效，高电平输出高阻状态																				  
***************************************************************************************/
#include "reg51.h"			 //此文件中定义了单片机的一些特殊功能寄存器
#include"intrins.h"
typedef unsigned int u16;	  //对数据类型进行声明定义
typedef unsigned char u8;

sbit SRCLK=P3^6;//上升沿进入移位寄存器
sbit RCLK=P3^5;	//上升沿将数据输出到并行端口
sbit SER=P3^4; //串行数据输入端

u8 ledwei[]={0x7f,0xbf,0xdf,0xef,0xf7,0xfb,0xfd,0xfe};

void delay(u16 i)
{
	while(i--);	
}
/*******************************************************************************
* 函数名         : Hc595SendByte(u8 dat)
* 函数功能		   : 向74HC595发送一个字节的数据
*******************************************************************************/
void Hc595SendByte(u8 dat)
{
	u8 a;
	SRCLK=0;
	RCLK=0;
	for(a=0;a<8;a++)
	{
		SER=dat>>7;	/*首先移入最高位*/
		dat<<=1;	/*移除最高位*/
		SRCLK=1;
		_nop_();
		_nop_();
		SRCLK=0;	
	}
/*循环8次依次把数据的每一位送入并行输出口*/
	for(a=0;a<8;a++)  
	{
		RCLK=1;
		_nop_();
		_nop_();
		RCLK=0;	
	}	
}
/*主函数*/
void main()
{			
	u8 i;
	while(1)
	{
		for(i=0;i<8;i++)//依次发送并把数据显示到led上
		{
			Hc595SendByte(ledwei[i]);
			delay(50000);		   //延时
		}			
	}		
}
