/**************************************************************************************
*		              8*8LED点阵———显示数字实验												  *
实现现象：下载程序后点阵上显示数字0
			
注意事项：一定要将JOE短接片短接到GND端，如果不需要595后面的小灯点亮可以拔掉JP595短接片。																				  
***************************************************************************************/
#include "reg51.h"			 //此文件中定义了单片机的一些特殊功能寄存器
#include"intrins.h"
typedef unsigned int u16;	  //对数据类型进行声明定义
typedef unsigned char u8;

sbit SRCLK=P3^6;//上升沿进入移位寄存器
sbit RCLK=P3^5;	//上升沿将数据输出到并行端口
sbit SER=P3^4; //串行数据输入端
u8 j=0;
u8 ledwei[]={0x7f,0xbf,0xdf,0xef,0xf7,0xfb,0xfd,0xfe};
u8 dat=0xfe;
/*******************************************************************************
* 函数名         : Hc595SendByte(u8 dat)
* 函数功能		   : 向74HC595发送一个字节的数据
*******************************************************************************/
void Hc595SendByte(u8 dat)
{
	u8 a;
	SRCLK=0;
	RCLK=0;
	for(a=0;a<8;a++)
	{
		SER=dat>>7;	/*首先移入最高位*/
		dat<<=1;	/*移除最高位*/
		SRCLK=1;
		_nop_();
		_nop_();
		SRCLK=0;	
	}
/*循环8次依次把数据的每一位送入并行输出口*/

		RCLK=1;
		_nop_();
		_nop_();
		RCLK=0;	
		
}
void Timer0() interrupt 1{
	
	j++;
	TL0=0xb0;  //50000*(11.0592/12)=46080
	TH0=0x3c;  //50000-46080=0x3cb0
	if(j==20){
	Hc595SendByte(dat);
	dat=_cror_(dat,1);
	j=0;}
	
}
/*主函数*/
void main()
{			
	TMOD=0x01;
	TL0=0xb0;  //50ms
	TH0=0x3c;
	ET0=1;
	EA=1;
	TR0=1;
	while(1);		
}
